; 77ad
Text00::	
	db $21,$15,$50,$53,$ff										; "めにゅー"
	
Text01::	
	db $0e,$02,$09,$2c,$05,$0f,$11,$2e,$08,$25,$ff				; "そうこをかたづける"
	
Text02::
	db $0e,$02,$09,$2c,$11,$07,$25,$ff							; "そうこをつくる"
	
Text03::
	db $13,$2e,$52,$10,$15,$0c,$25,$4b,$ff						; "どっちにする?"
	
Text04::
	db $0e,$02,$09,$1c,$01,$07,$ff								; "そうこへいく"
	
Text05::	
	db $0e,$02,$09,$18,$05,$06,$2e,$ff							; "そうこのかぎ"
	
Text06::	
	db $05,$2e,$2d,$19,$2e,$52,$12,$17,$4a,$ff					; "がんばってね!"
	
Text07::	
	db $22,$02,$01,$10,$13,$2e,$ff								; "もういちど"
	
Text08::	
	db $0e,$02,$09,$2c,$03,$23,$1b,$2e,$ff						; "そうこをえらぶ"
	
Text09::	
	db $28,$52,$0f,$17,$4a,$04,$21,$12,$2e,$13,$02,$ff			; "やったね!おめでとう"
	
Text0a::	
	db $11,$06,$2e,$18,$0e,$02,$09,$1c,$ff						; "つぎのそうこへ"
	
Text0b::	
	db $13,$2e,$02,$0c,$25,$4b,$ff								; "どうする?"
	
Text0c::	
	db $21,$15,$50,$53,$15,$22,$13,$2e,$25,$ff					; "めにゅーにもどる"
	
	
	; small box
	db $b9,$ff	
	; large box top
	db $a4,$a5,$ff
	; large box bottom
	db $a6,$a7,$ff
	
	
Text0d::	
	db $0e,$02,$09,$18,$05,$06,$2e,$2c,$00,$2b,$0d,$12,$07,$0f,$2e,$0a,$01,$ff		; "そうこのかぎをあわせてください"
	
Text0e::	
	db $04,$28,$4b,$d4,$1e,$10,$05,$2e,$52,$12,$25,$0e,$2e,$4a,$4a,$ff				; "おや? まちがってるぞ!!"
	

; 3 different lengths of spaces used in text
TextSpacesLong::
	db $d4,$d4,$d4,$d4,$d4
	
TextSpacesMed::
	db $d4,$d4,$d4,$d4
	
TextSpacesShort::
	db $d4,$d4,$d4,$d4,$d4,$d4,$d4,$d4,$d4,$d4,$d4,$ff

	
Text0f::
	db $0e,$02,$09,$18,$05,$06,$2e,$ff							; "そうこのかぎ"

UnknownTextData2::
	db $ff,$76,$78,$80,$78,$6d,$78,$6d,$78,$01,$01,$01,$01,$01,$01,$01,$01,$fe,$00,$00,$00,$00,$00,$00,$00
	db $00,$00,$fe,$02,$02,$02,$fe,$00,$e8,$f0,$e8,$f0,$00,$40,$48,$40,$48,$00,$48,$50,$48,$50,$02,$38,$40
	db $38,$40,$00,$58,$60,$58,$60,$00,$b8,$c0,$b8,$c0,$01,$38,$40,$38,$40,$01,$40,$48,$40,$48,$01,$50,$58
	db $50,$58,$00,$a8,$b0,$a8,$b0,$00,$18,$20,$18,$20,$c1,$78,$c5,$78,$c9,$78,$78,$78,$80,$80,$68,$68,$70
	db $70,$58,$58,$60,$60,$90,$80,$70,$70,$bc,$c4,$00,$01,$02,$03,$01,$01,$02,$04,$01,$01,$02,$05,$00,$02
	db $02,$03,$03,$00,$fb,$78,$09,$79,$14,$79,$1f,$79,$27,$79,$32,$79,$3a,$79,$42,$79,$49,$79,$4e,$79,$58
	db $79,$00
	
Text10::	
	db $1b,$2f,$26,$0d,$2e,$2d,$13,$d4,$0b,$2a,$02,$4a,$ff		; "ぷれぜんと しよう!"
	
Text11::	
	db $01,$2a,$01,$0b,$5c,$d4,$2a,$01,$0b,$5c,$ff				; "いよいしょ よいしょ"
	
Text12::	
	db $01,$06,$50,$02,$24,$5c,$02,$1a,$2e,$4a,$ff				; "いきゅうりょうび!"
	
Text13::	
	db $03,$05,$2e,$1a,$2e,$53,$2d,$ff							; "えがびーん"
	
Text14::	
	db $01,$07,$0b,$2e,$08,$14,$01,$0e,$2e,$4a,$ff				; "いくじけないぞ!"

Text15::
	db $02,$22,$02,$1a,$13,$01,$06,$ff							; "うもうひといき"
	
Text16::	
	db $02,$09,$2d,$13,$2e,$09,$0e,$ff							; "うこんどこそ"
	
Text17::	
	db $03,$0e,$52,$0e,$2d,$14,$ff								; "えそっそんな"	
	
Text18::	
	db $04,$04,$28,$4b,$ff										; "おおや?"
	
Text19::	
	db $01,$22,$52,$22,$0b,$28,$4e,$4e,$4e,$ff					; "いもっもしや..."
	
Text20::	
	db $02,$0e,$52,$0e,$02,$05,$4a,$ff							; "うそっそうか!"

UnknownTextData3::
	db $10,$78,$f6,$2c,$1a,$4b,$da,$07,$0e,$00,$d0,$0c,$81
	db $03,$2e,$04,$c5,$08,$f8,$00,$57,$05,$73,$07,$95,$04
	db $4e,$10,$86,$02,$46,$38

	; $680 bytes of padding at end of file
	rept $680
	db $00
	endr